cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/IrDA_STM32H7xx.c
  3. Under **Categories**: **System Core** select **DMA**:

     __Configuration__:
       - DMA1, DMA2:
       \n
         Click **Add** button and add DMA Requests as in table below:
            DMA Request | Stream         | Direction            | Priority
            :----------:|:--------------:|:---------------------|:--------
            USART1_RX   | DMA1 Stream 0  | Peripheral to Memory | Low
            USART1_TX   | DMA1 Stream 1  | Memory to Peripheral | Low
       \n

  4. Under **Categories**: **System Core** select **NVIC**:

     __Configuration__:
       - NVIC:
            NVIC Interrupt Table              | Enabled     | Preemption Priority | Sub Priority
            :---------------------------------|:-----------:|:-------------------:|:------------:
            DMA1 stream0 global interrupt     | **checked** | 0                   | 0
            DMA1 stream1 global interrupt     | **checked** | 0                   | 0
            USART1 global interrupt           | **checked** | 0                   | 0
       - Code generation:
            Enabled interrupt table           | Select for..| Generate Enable in..| Generate IRQ h.. | Call HAL handler
            :---------------------------------|:-----------:|:-------------------:|:----------------:|:----------------:
            DMA1 stream0 global interrupt     | unchecked   | checked             | checked          | checked
            DMA1 stream1 global interrupt     | unchecked   | checked             | checked          | checked
            USART1 global interrupt           | unchecked   | checked             | checked          | checked

### Clock Configuration tab

  1. Configure **To USART1 (MHz)**: **100**

### Project Manager tab

  1. Under **Advanced Settings**:

     __Generated Function Calls__:
        Generate Code | Function Name               | Peripheral Inst..| Do not generate ..| Visibility (Static)
        :-------------|:---------------------------:|:----------------:|:-----------------:|:-------------------:
        checked       | MX_USART1_IRDA_Init         | USART1           | **checked**       | checked

### Generate Code

Generate source code by clicking on the **GENERATE CODE** button on the toolbar.
*/

/*! \cond */

#include "IrDA_STM32H7xx.h"
#include "DCache_STM32H7xx.h"

#ifdef USARTx_MODE_IRDA

#define ARM_USART_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(2,3)

#ifndef IRDA_DCACHE_MAINTENANCE
#define IRDA_DCACHE_MAINTENANCE                (1U)
#endif
#ifndef IRDA_DCACHE_DATA_RX_ALIGNMENT
#define IRDA_DCACHE_DATA_RX_ALIGNMENT          (1U)
#endif
#ifndef IRDA_DCACHE_DATA_RX_SIZE
#define IRDA_DCACHE_DATA_RX_SIZE               (1U)
#endif
#ifndef IRDA_DCACHE_DATA_TX_ALIGNMENT
#define IRDA_DCACHE_DATA_TX_ALIGNMENT          (1U)
#endif
#ifndef IRDA_DCACHE_DATA_TX_SIZE
#define IRDA_DCACHE_DATA_TX_SIZE               (1U)
#endif

#define DRIVER_DCACHE_MAINTENANCE              (IRDA_DCACHE_MAINTENANCE)
#if    (DRIVER_DCACHE_MAINTENANCE == 1U) && ((IRDA_DCACHE_DATA_RX_ALIGNMENT == 0U) || (IRDA_DCACHE_DATA_RX_SIZE == 0U))
#define DRIVER_DCACHE_RX_USER_GUARANTEED       (1U)
#else
#define DRIVER_DCACHE_RX_USER_GUARANTEED       (0U)
#endif
#if    (DRIVER_DCACHE_MAINTENANCE == 1U) && ((IRDA_DCACHE_DATA_TX_ALIGNMENT == 0U) || (IRDA_DCACHE_DATA_TX_SIZE == 0U))
#define DRIVER_DCACHE_TX_USER_GUARANTEED       (1U)
#else
#define DRIVER_DCACHE_TX_USER_GUARANTEED       (0U)
#endif

// Driver Version
static const ARM_DRIVER_VERSION usart_driver_version = { ARM_USART_API_VERSION, ARM_USART_DRV_VERSION };

static const ARM_USART_CAPABILITIES Capabilities = {
    0,      ///< supports UART (Asynchronous) mode
    0,      ///< supports Synchronous Master mode
    0,      ///< supports Synchronous Slave mode
    0,      ///< supports UART Single-wire mode
    1,      ///< supports UART IrDA mode
    0,      ///< supports UART Smart Card mode
    0,      ///< Smart Card Clock generator available
    0,      ///< RTS Flow Control available
    0,      ///< CTS Flow Control available
    1,      ///< Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    0,      ///< Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    0,      ///< RTS Line: 0=not available, 1=available
    0,      ///< CTS Line: 0=not available, 1=available
    0,      ///< DTR Line: 0=not available, 1=available
    0,      ///< DSR Line: 0=not available, 1=available
    0,      ///< DCD Line: 0=not available, 1=available
    0,      ///< RI Line: 0=not available, 1=available
    0,      ///< Signal CTS change event: \ref ARM_USART_EVENT_CTS
    0,      ///< Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,      ///< Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0       ///< Signal RI change event: \ref ARM_USART_EVENT_RI
#if (defined(ARM_USART_API_VERSION) && (ARM_USART_API_VERSION >= 0x203U))
  , 0U  // Reserved bits
#endif
  };

// IrDA1
#ifdef USART1_MODE_IRDA
IRDAx_RESOURCE_ALLOC(1);
#endif

// IrDA2
#ifdef USART2_MODE_IRDA
IRDAx_RESOURCE_ALLOC(2);
#endif

// IrDA3
#ifdef USART3_MODE_IRDA
IRDAx_RESOURCE_ALLOC(3);
#endif

// IrDA4
#ifdef USART4_MODE_IRDA
IRDAx_RESOURCE_ALLOC(4);
#endif

// IrDA5
#ifdef USART5_MODE_IRDA
IRDAx_RESOURCE_ALLOC(5);
#endif

// IrDA6
#ifdef USART6_MODE_IRDA
IRDAx_RESOURCE_ALLOC(6);
#endif

// IrDA7
#ifdef USART7_MODE_IRDA
IRDAx_RESOURCE_ALLOC(7);
#endif

// IrDA8
#ifdef USART8_MODE_IRDA
IRDAx_RESOURCE_ALLOC(8);
#endif

// IrDA9
#ifdef USART9_MODE_IRDA
IRDAx_RESOURCE_ALLOC(9);
#endif

// IrDA10
#ifdef USART10_MODE_IRDA
IRDAx_RESOURCE_ALLOC(10);
#endif

/**
  \fn          const IRDA_RESOURCES IRDA_Resources (IRDA_HandleTypeDef *hirda)
  \brief       Get UART_RESOURCES structure from IRDA_HandleTypeDef
*/
static const IRDA_RESOURCES * IRDA_Resources (IRDA_HandleTypeDef *hirda) {
  const IRDA_RESOURCES *irda = NULL;

#ifdef USART1_MODE_IRDA
  if (hirda->Instance == USART1) { irda = &IRDA1_Resources; }
#endif
#ifdef USART2_MODE_IRDA
  if (hirda->Instance == USART2) { irda = &IRDA2_Resources; }
#endif
#ifdef USART3_MODE_IRDA
  if (hirda->Instance == USART3) { irda = &IRDA3_Resources; }
#endif
#ifdef USART4_MODE_IRDA
  if (hirda->Instance == UART4)  { irda = &IRDA4_Resources; }
#endif
#ifdef USART5_MODE_IRDA
  if (hirda->Instance == UART5)  { irda = &IRDA5_Resources; }
#endif
#ifdef USART6_MODE_IRDA
  if (hirda->Instance == USART6) { irda = &IRDA6_Resources; }
#endif
#ifdef USART7_MODE_IRDA
  if (hirda->Instance == UART7)  { irda = &IRDA7_Resources; }
#endif
#ifdef USART8_MODE_IRDA
  if (hirda->Instance == UART8)  { irda = &IRDA8_Resources; }
#endif
#ifdef USART9_MODE_IRDA
  if (hirda->Instance == UART9)  { irda = &IRDA9_Resources; }
#endif
#ifdef USART10_MODE_IRDA
  if (hirda->Instance == USART10)  { irda = &IRDA10_Resources; }
#endif

